cases/Nguyen/constant/fvModels
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}

flotation
{
    type    flotation;
}
