cases/Nguyen/0.org/Vf
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Vf;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    walls
    {
        type            fixedValue;
        value           $internalField;
    }
}
