cases/Nguyen/0.org/nut.nitrogen
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut.nitrogen;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }
    walls
    {
        type            nutkWallFunction;
        value           $internalField;
    }
}
