cases/Nguyen/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 16;

method simple;

simpleCoeffs
{
    n               (2 2 4);
    delta           0.001;
}
